Ran `terraform plan`:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.v4_arc_cluster.google_container_cluster.arc_v4_cluster will be created
  + resource "google_container_cluster" "arc_v4_cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + deletion_protection         = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-central2"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + min_master_version          = "1.28"
      + monitoring_service          = (known after apply)
      + name                        = "tpu-ci"
      + network                     = "default"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + release_channel {
          + channel = "RAPID"
        }
    }

  # module.v4_arc_cluster.google_container_node_pool.arc_v4_cpu_nodes will be created
  + resource "google_container_node_pool" "arc_v4_cpu_nodes" {
      + cluster                     = "tpu-ci"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central2"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "cpu-nodepool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "tpu-pytorch"
      + version                     = (known after apply)

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
        }
    }

  # module.v4_arc_cluster.google_container_node_pool.arc_v4_tpu_nodes will be created
  + resource "google_container_node_pool" "arc_v4_tpu_nodes" {
      + cluster                     = "tpu-ci"
      + id                          = (known after apply)
      + initial_node_count          = 0
      + instance_group_urls         = (known after apply)
      + location                    = "us-central2"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "tpu-nodepool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = [
          + "us-central2-b",
        ]
      + operation                   = (known after apply)
      + project                     = "tpu-pytorch"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy      = "ANY"
          + total_max_node_count = 1
          + total_min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "ct4p-hightpu-4t"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
        }
    }

  # module.v4_arc_cluster.helm_release.arc will be created
  + resource "helm_release" "arc" {
      + atomic                     = false
      + chart                      = "oci://ghcr.io/actions/actions-runner-controller-charts/gha-runner-scale-set-controller"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "actions-runner-controller"
      + namespace                  = "arc-systems"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = (known after apply)
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.v4_arc_cluster.helm_release.arc_runner_set will be created
  + resource "helm_release" "arc_runner_set" {
      + atomic                     = false
      + chart                      = "oci://ghcr.io/actions/actions-runner-controller-charts/gha-runner-scale-set"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "v4-runner-set"
      + namespace                  = "arc-runners"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                githubConfigUrl: https://github.com/pytorch/xla
                githubConfigSecret: github-pat
                minRunners: 0
                maxRunners: 1
                template:
                  spec:
                    containers:
                    - name: runner
                      image: gcr.io/tpu-pytorch/tpu-ci-runner:latest
                      command: ["/home/runner/run.sh"]
                      resources:
                        limits:
                          google.com/tpu: 4
                        requests:
                          google.com/tpu: 4
                    nodeSelector:
                      cloud.google.com/gke-tpu-accelerator: tpu-v4-podslice
                      cloud.google.com/gke-tpu-topology: 2x2x1
            EOT,
        ]
      + verify                     = false
      + version                    = (known after apply)
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```